// Tile Topology
// UVa ID: 491
// Verdict: Accepted
// Submission Date: 2025-11-30
// UVa Run Time: 0.000s
//
// 版权所有（C）2025，邱秋。metaphysis # yeah dot net

#include <bits/stdc++.h>
using namespace std;

// 单边多联骨牌数量 (OEIS A000988) n=1 到 32
const long long trick[] = {
    0, 1, 1, 2, 7, 18, 60, 196, 704, 2500, 9189, 33896, 126759, 476270, 
    1802312, 6849777, 26152418, 100203194, 385221143, 1485200848, 5741256764,
    22245940545, 86383382827, 336093325058, 1309998125640, 5114451441106, 
    19998172734786, 78306011677182, 307022182222506, 1205243866707468, 
    4736694001644862, 18635412907198670, 73293099546275655
};

int main() {
    int n;
    while (cin >> n) cout << trick[n] << '\n';
    return 0;
}
